package com.qf.liuzhongxu.p2pproject.commons.rabbitMQ;

import org.springframework.stereotype.Component;

import java.util.Arrays;

//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼           BUG辟易
//
//                             佛曰:
//
//                  写字楼里写字间，写字间里程序员；
//                  程序人员写程序，又拿程序换酒钱。
//                  酒醒只在网上坐，酒醉还来网下眠；
//                  酒醉酒醒日复日，网上网下年复年。
//                  但愿老死电脑间，不愿鞠躬老板前；
//                  奔驰宝马贵者趣，公交自行程序员。
//                  别人笑我忒疯癫，我笑自己命太贱；
//                  不见满街漂亮妹，哪个归得程序员？
@Component("mqListener")
public class MQListener {

	public void listen(String message){
		//TODO 注意更新数据
		//解析发送过来的数据
		System.out.println("收到的信息为" + message);
		//按照预先预定好的格式,进行数据的操作

		//比如获取到type是2的情况下就查询数据库,然后更新到缓存

		//如果获取到的type是1的情况下,我们就直接将数据更新到redis(需要提前转成对象) 更新到redis的时候注意空的数据不要更新进去

		//更新redis

		//更新数据库之类的
	}

}
